///////////////////////////////////////////////////////////////////////////////
//	 ласс "одиночка"
//	
///////////////////////////////////////////////////////////////////////////////

#ifndef SINGLETONE_H
#define SINGLETONE_H

namespace Rblib
{
	/// –еализаци€ шаблона синглтон.
	/// \details —инглтон ћейерса. –еализует интерфейс, позвол€ющий получить ссылку на единственный экземпл€р объекта.
	/// \tparam T “ип, к экземпл€ру которого будет предоставл€тьс€ доступ.
	template<class T>
	class Singletone
	{
	public:
		
		/// ѕолучить экземпл€р.
		static T& Instance()
		{
		  static T t;
		  return t;
		}
	};
}

#endif // SINGLETONE_H